src/cf/InformationRegisters/уатОбеспечениеЗаказовНаТСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатОбеспечениеЗаказовНаТСВагонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГУ12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вагон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/уатТипыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатТипыТС</Name>
			<Comment>Типы ТС (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТС</Name>
					<Comment>Вид ТС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Comment>Грузоподъемность, тонн</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самосвал</Name>
					<Comment>Является самосвалом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерВысота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерШирина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемКузова</Name>
					<Comment>Объем кузова (м3)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодВагона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКлассификаторРодовПодвижногоСостава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СовместимыеТипыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьДополнительныеРеквизиты</Name>
					<Comment>Удалено в 1.1.10.1 из-за расхождения идентификаторов в Стд и Корп</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбязательныеВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Принадлежность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатПринадлежностьДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКатегорииДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатКодыЕТСНГ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатКодыЕТСНГ</Name>
			<Comment>Единая тарифно-статистическая номенклатура грузов (ЕТСНГ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйКласс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатКодыГНГ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатКодыГНГ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатОбеспечениеЗаказовНаТСВагонами/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавлениИзФормыЗаказа = Ложь;
	Если Параметры.Свойство("Заказ") Тогда
		ДобавлениИзФормыЗаказа = Истина;
		Запись.ЗаказНаТС = Параметры.Заказ;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипВагона") Тогда
		ТипВагона = Параметры.ТипВагона;
	КонецЕсли;
	
	Если Параметры.Свойство("ГрузовоеМесто") Тогда
		Если ТипЗнч(Параметры.ГрузовоеМесто) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда
			Запись.Груз = Параметры.ГрузовоеМесто;
		КонецЕсли;
		Груз = Параметры.ГрузовоеМесто;
	КонецЕсли;
	
	УстановитьВидимость();
	
	Если ДобавлениИзФормыЗаказа И ТипВагона <> Справочники.уатТипыТС.ПустаяСсылка() Тогда
		Элементы.ДекорацияТипВагона.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по типу вагона: %1.'");
		Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", ТипВагона.Наименование);
	КонецЕсли;
	
	Если ДобавлениИзФормыЗаказа И (Груз <> Справочники.уатГрузовыеМеста_уэ.ПустаяСсылка() Или Груз <> Справочники.уатКодыЕТСНГ.ПустаяСсылка()
		Или Груз <> Справочники.уатКодыГНГ.ПустаяСсылка() Или Груз <> Неопределено) Тогда
		Элементы.ДекорацияГруз.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по %1.'");
		Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
			СтрокаДляПодстановки = НСтр("ru = 'грузовому месту: %1'; en = 'cargo space: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
			СтрокаДляПодстановки = НСтр("ru = 'коду ЕТСНГ: %1'; en = 'ETSNG code: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
			СтрокаДляПодстановки = НСтр("ru = 'коду ГНГ: %1'; en = 'GNG code: %1'");
		КонецЕсли;
		
		СтрокаДляПодстановки = СтрЗаменить(СтрокаДляПодстановки, "%1", Строка(Груз));
		Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", СтрокаДляПодстановки);
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияВеса = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияВеса();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияВеса) Тогда
		Элементы.Вес.Заголовок = НСтр("en='Weight, ';ru='Вес, '") + ПредставлениеЕдиницыИзмеренияВеса;
	КонецЕсли;
	
	ПредставлениеЕдиницыИзмеренияОбъема = уатОбщегоНазначенияПовтИсп.ПолучитьПредставлениеОсновнойЕдиницыИзмеренияОбъема();
	Если ЗначениеЗаполнено(ПредставлениеЕдиницыИзмеренияОбъема) Тогда
		Элементы.Объем.Заголовок = НСтр("en='Volume, ';ru='Объем, '") + ПредставлениеЕдиницыИзмеренияОбъема;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.КодГруза) Тогда
		Запись.КодГруза = Запись.Груз.КодЕТСНГ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГрузПриИзменении(Элемент)
	
	Запись.КодГруза = ПолучитьКодЕТСНГ(Запись.Груз);
	
	Если ДобавлениИзФормыЗаказа И (Груз <> ПредопределенноеЗначение("Справочник.уатГрузовыеМеста_уэ.ПустаяСсылка")
		Или Груз <> ПредопределенноеЗначение("Справочник.уатКодыЕТСНГ.ПустаяСсылка")
		Или Груз <> ПредопределенноеЗначение("Справочник.уатКодыГНГ.ПустаяСсылка")
		Или Груз <> Неопределено) Тогда
		
		Элементы.ДекорацияГруз.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по %1. '");
		
		Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
			ГрузПриИзменении = Запись.Груз;
			СтрокаДляПодстановки = НСтр("ru = 'грузовому месту: %1'; en = 'cargo space: %1'");
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
			ГрузПриИзменении = ПолучитьКодЕТСНГ(Запись.Груз);
			СтрокаДляПодстановки = НСтр("ru = 'коду ЕТСНГ: %1'; en = 'ETSNG code: %1'")
		ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
			ГрузПриИзменении = ПолучитьКодГНГ(Запись.Груз);
			СтрокаДляПодстановки = НСтр("ru = 'коду ГНГ: %1'; en = 'GNG code: %1'");
		КонецЕсли;
		
		СтрокаДляПодстановки = СтрЗаменить(СтрокаДляПодстановки, "%1", Строка(Груз));
		
		Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", СтрокаДляПодстановки);
		
		Если ГрузПриИзменении <> Груз Тогда
			
			Если ТипЗнч(Груз) = Тип("СправочникСсылка.уатГрузовыеМеста_уэ") Тогда 
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбрано грузовоме место: %1'; en = 'Selected cargo space: %1'");
			ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыЕТСНГ") Тогда
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбран код ЕТСНГ: %1'; en = 'The ETSNG code selected was: %1'");
			ИначеЕсли ТипЗнч(Груз) = Тип("СправочникСсылка.уатКодыГНГ") Тогда
				Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
					+ НСтр("ru = 'Выбран код ГНГ: %1'; en = 'The selected GNG code is: %1'");
			КонецЕсли;
			
			Элементы.ДекорацияГруз.Заголовок = СтрЗаменить(Элементы.ДекорацияГруз.Заголовок, "%1", Строка(ГрузПриИзменении));
			Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок + НСтр("ru = '"
"После записи, ТЧ ""Обеспечение вагонами"" не изменится!'; en = '"
"After registration, the ""Wagon Supply"" TC will not change!'");
			
		ИначеЕсли ГрузПриИзменении = Груз Тогда
			
			Элементы.ДекорацияГруз.Заголовок = Элементы.ДекорацияГруз.Заголовок 
			+ НСтр("ru = '"
"Выбранное значение удовлетворяет отбору документа.'; en = '"
"The selected value satisfies the document selection.'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВагонПриИзменении(Элемент)
	
	Если ДобавлениИзФормыЗаказа И ТипВагона <> ПредопределенноеЗначение("Справочник.уатТипыТС.ПустаяСсылка") Тогда
		
		ТипВагонаПриИзменении = ПолучитьТипВагона(Запись.Вагон);
		
		Элементы.ДекорацияТипВагона.Заголовок = НСтр("ru='В строке табличной части документа установлен отбор по типу вагона: %1. '");
		Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", Строка(ТипВагона));
		
		Если ТипВагонаПриИзменении <> ТипВагона Тогда
			
			Элементы.ДекорацияТипВагона.Заголовок = Элементы.ДекорацияТипВагона.Заголовок 
			+ НСтр("ru = 'Выбран вагон с типом %1."
"После записи, ТЧ ""Обеспечение вагонами"" не изменится!'; en = 'A wagon of type %1 has been selected."
"After recording, the ""Wagon Provision"" TC will not change!'");
			
			Элементы.ДекорацияТипВагона.Заголовок = СтрЗаменить(Элементы.ДекорацияТипВагона.Заголовок, "%1", Строка(ТипВагонаПриИзменении));
			
		ИначеЕсли ТипВагонаПриИзменении = ТипВагона Тогда
			
			Элементы.ДекорацияТипВагона.Заголовок = Элементы.ДекорацияТипВагона.Заголовок 
			+ НСтр("ru = '"
"Выбранное значение удовлетворяет отбору документа.'; en = '"
"The selected value satisfies the document selection.'");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если ТипВагона <> Справочники.уатТипыТС.ПустаяСсылка() Тогда
		Элементы.ГруппаВагонПодсказка.Видимость = Истина;
	Иначе
		Элементы.ГруппаВагонПодсказка.Видимость = Ложь;
	КонецЕсли;
	
	Если Груз = Справочники.уатГрузовыеМеста_уэ.ПустаяСсылка() Или Груз = Справочники.уатКодыЕТСНГ.ПустаяСсылка()
		Или Груз = Справочники.уатКодыГНГ.ПустаяСсылка() Или Груз = Неопределено Тогда
		Элементы.ГруппаГрузПодсказка.Видимость = Ложь;
	Иначе
		Элементы.ГруппаГрузПодсказка.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипВагона(Вагон)
	
	Возврат Вагон.ТипТС;
	
КонецФункции

&НаСервере
Функция ПолучитьКодЕТСНГ(Груз)
	
	Возврат Груз.КодЕТСНГ;
	
КонецФункции

&НаСервере
Функция ПолучитьКодГНГ(Груз)
	
	Возврат Груз.КодГНГ;
	
КонецФункции

#КонецОбласти
